EcSUHA/ESP32_DeVICE_Module/ESP32_Control_Module.c
// -------------------------------------------------------------------------------------------

  return retMsg;

  }













/**
 *   Data structure for implemented query keys and affected readings
 *   used as input for Key=Value parsing, proc SCDEH_ParseStrToparsedKVInput
 */
typedef struct ESP32_Control_kvParseImplementedKeys_s {

  const uint32_t affectedReadings;

  const char *implementedKey;

  } ESP32_Control_kvParseImplementedKeys_t;



/*
 *   Result structure for http_parser_parse_url().
 *   Callers should index into field_data[] with UF_* values if field_set
 *   has the relevant (1 << UF_*) bit set. As a courtesy to clients (and
 *   because we probably have padding left over), we convert any port to
 *   a uint32_t.
 */
typedef struct ESP32_Control_parsedKVInput_s {

  uint64_t keysFoundBF;		// Bit-Field of found keys (1 << XX_IK_*)

  struct ESP32_Control_keyData_s {

	uint16_t off;		// Offset into buffer in which value-text starts

	uint16_t len;		// Length of value-text in buffer

	uint32_t affectedReadings;

	} ESP32_Control_keyData_t[];		// XX_IK_MAX

  } ESP32_Control_parsedKVInput_t;



/*
 * Find the first occurrence of find in s, where the search is limited to the
 * first slen characters of s.
 */
char * ICACHE_FLASH_ATTR
ESP32_Control_strnstr(s, find, slen)
	const char *s;
	const char *find;
	size_t slen;
{
	char c, sc;
	size_t len;

	if ((c = *find++) != '\0') {
		len = strlen(find);
		do {
			do {
				if ((sc = *s++) == '\0' || slen-- < 1)
					return (NULL);
			} while (sc != c);
			if (len > slen)
				return (NULL);
		} while (strncmp(s, find, len) != 0);
		s--;
	}
	return ((char *)s);
}



/**   // query keys dürfen keine encoded zeichen enthalten!
 *--------------------------------------------------------------------------------------------------
 *FName: ESP32_Control_ParseKVInputArgs Parse Key=Value@ input Arguments
 * Desc: Hepler routine that searches and extracts an SPECIAL string value matching the given key. 
 *       Source data is an key=value pair string, seperated by an "&" from an query string
 *       WARNING: FOR FIRST and LAST CHAR ONLY ALPHA OR NUMMERICALAL IS ALLOWED !	  
 * Para: int num -> number of implemented KEYs for this query-type
 *       const implementedKeys *XX_IK -> list of implemented KEYs for this query-type
 *       const char *QueryStr -> ptr to zero-teriminated KEY=VALUE string from query, seperated by '&'
 * Rets: struct SCDE_XX_parsedKVInput *parsedKVInput -> allocad struct, filled with data
 *       DONT FORGET TO FREE MEMORY !
 *--------------------------------------------------------------------------------------------------
 */
ESP32_Control_parsedKVInput_t* ICACHE_FLASH_ATTR
ESP32_Control_ParseKVInputArgs(int numImplementedKeys
			,const ESP32_Control_kvParseImplementedKeys_t *XX_IK
			,const uint8_t *kvArgs
			,const size_t kvArgsLen)
  {

  // alloc memory for ESP32_Control_parsedKVInput_t -> length is variable !
  int memlen =  8 + (numImplementedKeys * (2+2+4));

  #if SCDEH_DBG >= 5
  printf("|PKVInput-malloc:%d, input:\"%.*s\">"
	,memlen
	,kvArgsLen
	,kvArgs);
  #endif

  ESP32_Control_parsedKVInput_t *parsedKVInput =
	(struct ESP32_Control_parsedKVInput_s *) malloc(memlen);

  // clear keys-found bitfield
  parsedKVInput->keysFoundBF = 0;

  // implemented keys loop
  int i;
  for ( i = 0 ; i < numImplementedKeys ; i++ ) {

	// get ptr to current key
	const char *key = XX_IK[i].implementedKey;

	#if SCDEH_DBG >= 5
	printf("|chk for KEY:%d-\"%s\", "
		,i
		,key);
	#endif

	const uint8_t *p = kvArgs;		// kv-args start ptr
	const uint8_t *ep = kvArgs + kvArgsLen;	// kv-args end ptr
	const uint8_t *e;			// end ptr 
	int keylen = strlen(key);		// lenght of implemented key

//	while ( (p != NULL) && (*p != '\n') && (*p != '\r') && (*p != 0) )

	while ( (p != NULL) && (p < ep) ) {

		# if SCDEH_DBG >= 5
		printf("cmp:\"%.*s\""
			,keylen
			,p);
		# endif

		// matches value? and is "=" after value?
		if ( (strncasecmp((char*) p, key, keylen) == 0 ) && (p[keylen] == '=') ) {

			// move p to start of the VALUE (from this KEY)
			p += keylen + 1;

			// move e to end of the VALUE (from this KEY)
			e = (uint8_t *) ESP32_Control_strnstr((char*) p, "&", ep - p);

			// or is it last Key-Value pair?
			if (e == NULL) e = ep;

 			# if SCDEH_DBG >= 5
			printf(", next cmp:\"%.*s\""
				,(e-p)
				,p);
			# endif

			// store positive result -> do not forget to url-encode !
			parsedKVInput->keysFoundBF |= (uint64_t) 1<<i;
			parsedKVInput->ESP32_Control_keyData_t[i].off = (p-kvArgs); // or better store ptr?
			parsedKVInput->ESP32_Control_keyData_t[i].len = (e-p);
			parsedKVInput->ESP32_Control_keyData_t[i].affectedReadings = 
				XX_IK[i].affectedReadings;

			// KEY found
			# if SCDEH_DBG >= 5
			printf(", found!>");
			# endif

			break;

			}

		// jump after next "&"
		p = (uint8_t*) ESP32_Control_strnstr((char*) p, "&", ep - p);

		if (p != NULL) p += 1;

		}

	// KEY not found
	# if SCDEH_DBG >= 5
	printf(">");
	# endif

	}

  // Query parsed complete
  # if SCDEH_DBG >= 5
  SCDEFn->HexDumpOutFn ("|parsedKVInput-HEX",
	parsedKVInput,
	memlen);
  # endif

  return parsedKVInput;

  }













/**
 * For Set-Input: enum of implemented keys
 * KEYs-Field-Set for Feature specific query. Will be generated by SCDEH_ParseStrToparsedKVInput()
 * parsed result is stored in ESP32_Control_parsedKVInput_t
 */
enum ESP32_Control_Set_IK {				// Bit #XX for debugging

   // Block 1 - func
    ESP32_Control_Set_IK_NAME		= 0		// Bit #00 'NAME'			-> 
  , ESP32_Control_Set_IK_WSAP_Password			// Bit #01 'WSAP_Password'		-> 
  , ESP32_Control_Set_IK_WSAP_RF_Channel		// Bit #02 'WSAP_RF_Channel' 		-> 
  , ESP32_Control_Set_IK_WSAP_Maximal_Connections	// Bit #03 'WSAP_Maximal_Connections'  	-> 
  , ESP32_Control_Set_IK_WSAP_Authentication_Method	// Bit #04 'WSAP_Authentication_Method' -> 
  , ESP32_Control_Set_IK_WSAP_SSID			// Bit #05 'WSAP_SSID'  		-> 
  , ESP32_Control_Set_IK_WSAP_Beacon_Interval		// Bit #06 'WSAP_Beacon_Interval'  	-> 

   // Block 2 - func
  , ESP32_Control_Set_IK_WSAP_IP_Adress			// Bit #07 'WSAP_DHCPS'  		-> 
  , ESP32_Control_Set_IK_WSAP_Netmask			// Bit #08 'WSAP_Netmask'  		-> 
  , ESP32_Control_Set_IK_WSAP_Gateway_Adress		// Bit #09 'WSAP_Gateway_Adress'  	-> 

   // Block 3 - func
  , ESP32_Control_Set_IK_WSAP_MAC_Adress		// Bit #10 'WSAP_MAC_Adress'  		-> 

   // Block 4 - func
  , ESP32_Control_Set_IK_WSAP_WiFi_Bandwidth		// Bit #11 'WSAP_WiFi_Bandwidth'	-> 

