EcSUHA/ESP32_DeVICE_Module/ESP32_Control_Module.c
  };



/* For: SCDE_cgi
 * Implemented KEYS and assigned readings for this query - analyzed by by http_parser_parse_url()
 * Num should meet enum XX_QueryFields
 * Result is stored in struct SCDE_XX_parsedKVInput
 */
ESP32_Control_kvParseImplementedKeys_t ESP32_Control_Set_ImplementedKeys[] =
  {//affected_reading | affected_reading			|  CMD
  // Block 1 - func
   { SCDE_R_NAME						, "name" }			// #00
  ,{ SCDE_R_WSAP_Password					, "WSAP_Password" }		// #01
  ,{ SCDE_R_WSAP_RF_Channel					, "WSAP_RF_Channel" }		// #02
  ,{ SCDE_R_WSAP_Maximal_Connections				, "WSAP_Maximal_Connections" }	// #03
  ,{ SCDE_R_WSAP_Authentication_Method				, "WSAP_Authentication_Method" }// #04
  ,{ SCDE_R_WSAP_SSID						, "WSAP_SSID" }			// #05
  ,{ SCDE_R_WSAP_Beacon_Interval				, "WSAP_Beacon_Interval" }	// #06

  // Block 2 - func
  ,{ SCDE_R_WSAP_IP_Adress					, "WSAP_IP_Adress" }		// #07
  ,{ SCDE_R_WSAP_Netmask					, "WSAP_Netmask" }		// #08
  ,{ SCDE_R_WSAP_Gateway_Adress					, "WSAP_Gateway_Adress" }	// #09

  // Block 3 - func
  ,{ SCDE_R_WSAP_MAC_Adress					, "WSAP_MAC_Adress" }		// #10

  // Block 4 - func
  ,{ SCDE_R_WSAP_WiFi_Bandwidth					, "WSAP_WiFi_Bandwidth" }	// #11

  // Block 5 - func
  ,{ SCDE_R_WiFi_Country					, "WiFi-Country" }		// #12

  // Block 6 - func
  ,{ SCDE_R_Station_IP_Adress					, "Station_IP_Adress" }		// #13
  ,{ SCDE_R_Station_Netmask					, "Station_Netmask" }		// #14
  ,{ SCDE_R_Station_Gateway_Adress				, "Station_Gateway_Adress" }	// #15

  // Block 7 - func
  ,{ SCDE_R_Station_MAC_Adress					, "Station_MAC_Adress" }	// #16

  // Block 8 - func
  ,{ SCDE_R_Station_Auto_Connect				, "Station_Auto_Connect" }	// #17

  // Block 9 - func
  ,{ SCDE_R_Station_WiFi_Bandwidth				, "Station_WiFi_Bandwidth" }	// #18



















  // Block 3 - func
  ,{ SCDE_R_WSAP_DHCPS_Lease_Start_IP				, "WSAP_DHCPS_Lease_Start_IP" }	// #10
  ,{ SCDE_R_WSAP_DHCPS_Lease_End_IP				, "WSAP_DHCPS_Lease_End_IP" }	// #11

  // Block 4 - func
  ,{ SCDE_R_WSAP_DHCPS						, "WSAP_DHCPS" }		// #12

  // Block 6 - func
  ,{ SCDE_R_WSAP						, "WSAP" }			// #14

  // Block 8 - func
  ,{ SCDE_R_Station						, "Station" }			// #18

  // Block 9 - func
  ,{ SCDE_R_Station_DHCP					, "Station_DHCP" }		// #19

  // Block 11 - func
  ,{ SCDE_R_Station_Physical_Mode				, "Station_Physical_Mode" }	// #21

  // Block 12 - func
  ,{ SCDE_R_Station_RSSI					, "Station_Get_RSSI" }		// #22

   // Block 14 - func
  ,{ SCDE_R_TiSt_NTP_Server_Main				, "TiSt_NTP_Server_Main" }	// #24

  // Block 15 - func
  ,{ SCDE_R_TiSt_NTP_Server_Backup_1				, "TiSt_NTP_Server_Backup_1" }	// #25

  // Block 16 - func
  ,{ SCDE_R_TiSt_NTP_Server_Backup_2				, "TiSt_NTP_Server_Backup_2" }	// #26

  // Block 17 - func
  ,{ SCDE_R_TiSt_Time_Zone					, "TiSt_Time_Zone" }		// #27

  // Block 18 - func
  ,{ SCDE_R_TiSt_Time						, "TiSt_Get_Time" }		// #28

  // Block 18 - func
  ,{ 0								, "SoCHW_Restart" }		// #29

  // Block 18 - func
  ,{ 0								, "SoCHW_Factory_Reset_SCDE" }	// #30

  // Block 18 - func
  ,{ 0								, "SoCHW_Factory_Reset_CAPI" }	// #31

 // Block 18 - func
  ,{ 0								, "SoCHW_Factory_Reset" }	// #32

  }; // !!! number of implemented keys should be equal with XX_IK_Number_of_keys, LIMIT IS 64 ELEMENTS !!!




/*"WSAP_Password ";
	$list .= "WSAP_RF_Channel:uzsuSelectRadio,1,2,3,4,5,6,7,8,9,10,11,12,13 ";

"WSAP_Beacon_Interval:slider,100,10,60000 ";

uint8Slider,a,b,c
uint16Slider,a,b,c
uint32Slider,a,b,c
int8Slider,a,b,c
int16Slider,a,b,c
int32Slider,a,b,c


*/









/**
 * -------------------------------------------------------------------------------------------------
 *  FName: ESP32_Control_Rename
 *  Desc: FN is called when a Definition of this Module was renamed. Module can do further things here. 
 *  Info: An FN for Rename is optional!
 *  Para: ESP32_Control_Definition_t *ESP32_Control_Definition -> ESP32_Control Definition that was renamed
 *        uint8_t *newName -> ptr to the new name (do we need it???)
 *        size_t newNameLen -> length of the new name
 *        uint8_t *oldName -> ptr to old name
 *        size_t oldNameLen -> length of the old name
 *  Rets: strTextMultiple_t* -> response text in allocated memory, NULL=no text
 * -------------------------------------------------------------------------------------------------
 */
strTextMultiple_t*
ESP32_Control_Rename(Common_Definition_t *Common_Definition
	,uint8_t *newName
	,size_t newNameLen
	,uint8_t *oldName
	,size_t oldNameLen)
{
	
	// for Fn response msg
  strTextMultiple_t *multipleRetMsg = NULL;
	
  // make common ptr to modul specific ptr
  ESP32_Control_Definition_t* ESP32_Control_Definition =
		(ESP32_Control_Definition_t*) Common_Definition;

	SCDEFn->Log3Fn(Common_Definition->name
		,Common_Definition->nameLen
		,5
		,"RenameFn of Module '%.*s' is called for Definition '%.*s'. Definition got new name. Old name was '%.*s'."
		,ESP32_Control_Definition->common.module->ProvidedByModule->typeNameLen
		,ESP32_Control_Definition->common.module->ProvidedByModule->typeName
		,newName
		,newNameLen
		,oldName
		,oldNameLen);
	
	return multipleRetMsg;
}
	
	

/**
 * -------------------------------------------------------------------------------------------------
 *  FName: ESP32_Control_Set
 *  Desc: Processes the device-specific command line arguments from the set command
 *  Info: Invoked by cmd-line 'Set ESP32_Control_Definition.common.Name setArgs'
 *  Para: ESP32_Control_Definition_t *ESP32_Control_Definition -> WebIF Definition that should get a set cmd
 *        uint8_t *setArgs -> the setArgs
 *        size_t setArgsLen -> length of the setArgs
 *  Rets: strTextMultiple_t* -> response text in allocated memory, NULL=no text
 * -------------------------------------------------------------------------------------------------
 */
strTextMultiple_t* ICACHE_FLASH_ATTR
ESP32_Control_Set(Common_Definition_t* Common_Definition
	,uint8_t *setArgs
	,size_t setArgsLen)
  {

  // for Fn response msg
  strTextMultiple_t *retMsg = NULL;

  // beginning with '?' ?
  if ( (setArgsLen > 0) && (*setArgs == '?') ) {

	// set start of possible Type-Name
	const uint8_t *tempTxt = setArgs + 1;

	// a seek-counter
	int i = 1;

	// skip spaces after '?' (search for more ...)
	while( (i < setArgsLen) && (*tempTxt == ' ') ) {i++;tempTxt++;}

