EcSUHA/ESP32_DeVICE_Module/ESP32_Control_Module.c
	// only spaces after '?' -> answer with Set-Capabilities
	if (i == setArgsLen) {

		// response with error text
		// alloc mem for retMsg
		retMsg = malloc(sizeof(strTextMultiple_t));

		// response with error text
		retMsg->strTextLen = asprintf(&retMsg->strText
			,"requested ? '%.*s' !"
			,setArgsLen
			,setArgs);

		return retMsg;

		}
	// '? + X' here !!! -> normal parse
	}

  // Parse set-args (key=value@) protocol) and get parsedKVInput in allocated mem
  ESP32_Control_parsedKVInput_t *parsedKVInput = 
	ESP32_Control_ParseKVInputArgs(ESP32_Control_Set_IK_Number_of_keys	// Num Implementated KEYs MAX for Set Fn
	,ESP32_Control_Set_ImplementedKeys	// Implementated Keys for Set Fn
	,setArgs				// our args text
	,setArgsLen);				// our args text len

// -------------------------------------------------------------------------------------------------
// Prepare structures with current values from SDK
// -------------------------------------------------------------------------------------------------

  // block #1 get current Service-AP settings
  wifi_config_t ap_wifi_config;
  esp_wifi_get_config (WIFI_IF_AP, &ap_wifi_config);

  // block #2  get current Service AP IP-Settings
  tcpip_adapter_ip_info_t ap_ip_info;
  tcpip_adapter_get_ip_info(TCPIP_ADAPTER_IF_AP, &ap_ip_info);

  // block #3 get current Service AP MAC Adress
  uint8_t ap_mac_addr[8];
  esp_wifi_get_mac(WIFI_IF_AP,(uint8_t *) &ap_mac_addr);

  // block #4 get the bandwith of the Service Access Point
  wifi_bandwidth_t ap_wifi_bandwidth;
  esp_wifi_get_bandwidth(WIFI_IF_AP, &ap_wifi_bandwidth);

  // block #5 get the WiFi Country
  wifi_country_t country;
  esp_wifi_get_country(&country);

  // block #6 get current Station IP Settings
  tcpip_adapter_ip_info_t sta_ip_info;
  tcpip_adapter_get_ip_info(TCPIP_ADAPTER_IF_STA, &sta_ip_info);

  // block #7 get current Station MAC Adress
  uint8_t sta_mac_addr[8];
  esp_wifi_get_mac(WIFI_IF_STA, (uint8_t *) &sta_mac_addr);

  // block #8 get current Station Auto-Connect-Status
  bool sta_autoconnect_status;
  esp_wifi_get_auto_connect(&sta_autoconnect_status);

  // block #9 get the bandwith of Station
  wifi_bandwidth_t sta_wifi_bandwidth;
  esp_wifi_get_bandwidth(WIFI_IF_STA, &sta_wifi_bandwidth);











//#3
  // block #6 get current Station Settings
  wifi_config_t sta_wifi_config;
  esp_wifi_get_config (WIFI_IF_STA, &sta_wifi_config);

  // block #3 get current Service AP DHCP-Server-Status
  tcpip_adapter_dhcp_status_t ap_dhcp_status;
  tcpip_adapter_dhcps_get_status(TCPIP_ADAPTER_IF_AP,&ap_dhcp_status); 
//esp_err_t tcpip_adapter_dhcps_stop(tcpip_adapter_if_t tcpip_if);
//esp_err_t tcpip_adapter_dhcps_start(tcpip_adapter_if_t tcpip_if);

  // block #8 get current Station DHCP-Client-Status
  tcpip_adapter_dhcp_status_t sta_dhcp_status;
  tcpip_adapter_dhcpc_get_status(TCPIP_ADAPTER_IF_STA,&sta_dhcp_status); 
//esp_err_t tcpip_adapter_dhcpc_start(tcpip_adapter_if_t tcpip_if);
//esp_err_t tcpip_adapter_dhcpc_stop(tcpip_adapter_if_t tcpip_if);

  // block #13 get current Wifi operating mode (Station + Service AP)
  wifi_mode_t wifi_mode;
  esp_wifi_get_mode(&wifi_mode);

  // block #14 get current Wifi operating mode (Station + Service AP)
  wifi_ps_type_t wifi_ps_type;
  esp_wifi_get_ps(&wifi_ps_type);


/*
  // block #3 get current Service AP DHCP-Settings
//spz    struct dhcps_lease dhcps_lease;
//spz   wifi_softap_get_dhcps_lease(&dhcps_lease);

//spz  // block #11 get current Station Physical Mode
//spz  int WifiStationPhyMode = wifi_get_phy_mode();

*/


  // remember the readings affected by the parsing process
  uint32_t affectedReadings = 0;

// -------------------------------------------------------------------------------------------------

  // name=[a-f-A-F0-9] -> Setze Farbe für RGB Kanal (uint24) (0-x)
  // name=[a-f-A-F0-9] -> Set color for RGB channel (uint24) (0-x)
  if (parsedKVInput->keysFoundBF == (uint64_t) 1 << ESP32_Control_Set_IK_NAME) {

	// valid input happened ?
	if (SCDEH_GetSpecialStrVal(setArgs+parsedKVInput->ESP32_Control_keyData_t[ESP32_Control_Set_IK_NAME].off
		,parsedKVInput->ESP32_Control_keyData_t[ESP32_Control_Set_IK_NAME].len
		,(char*) &ap_wifi_config.ap.ssid
		,sizeof (ap_wifi_config.ap.ssid)
		,2) ) {	

		// mark affected readings for TX
		affectedReadings |= parsedKVInput->ESP32_Control_keyData_t[ESP32_Control_Set_IK_NAME].affectedReadings;

//		// New Timestamp
//		SysCfgRamNoMirror->MySCDE_FeatCfgRamNoMirror[ADID].IB01_X_TiSt =
//			GetUniqueTIST();

//		// Push processed CMD to to Response ...
//		RespArgsWPos += sprintf( RespArgsWPos,"cmd=name");

	}
  }

// -------------------------------------------------------------------------------------------------


  // rval=[0-9] -> Setze Wert für den roten Anteil vom RGB Kanal (uint8) (0-x)
  // rval=[0-9] -> Set value for the red component of the RGB channel (uint8) (0-x)

  if (parsedKVInput->keysFoundBF == (uint64_t) 1 << ESP32_Control_Set_IK_WSAP_Password) {

	// valid input happened ?
	if (SCDEH_GetSpecialStrVal(setArgs+parsedKVInput->ESP32_Control_keyData_t[ESP32_Control_Set_IK_WSAP_Password].off
		,parsedKVInput->ESP32_Control_keyData_t[ESP32_Control_Set_IK_WSAP_Password].len
		,(char*) &ap_wifi_config.ap.password
		,sizeof (ap_wifi_config.ap.password)
		,2) ) {	

		// mark affected readings for TX
		affectedReadings |= parsedKVInput->ESP32_Control_keyData_t[ESP32_Control_Set_IK_WSAP_Password].affectedReadings;

		// New Timestamp
//		SysCfgRamNoMirror->MySCDE_FeatCfgRamNoMirror[ADID].IB01_X_TiSt =
//			GetUniqueTIST();

//		// Push processed CMD to to Response ...
//		RespArgsWPos += sprintf( RespArgsWPos,"cmd=WSAP_Password");

	}
  }

// -------------------------------------------------------------------------------------------------

  // WSAP_RF_Channel=[1-13] -> Setze Wireless Service Access Point Kanal (Station Kanal hat Priorität)
  // WSAP_RF_Channel=[1-13] -> Set Wireless Service Access Point channel (Station Channel has priority)

  if (parsedKVInput->keysFoundBF == (uint64_t) 1 << ESP32_Control_Set_IK_WSAP_RF_Channel) {

	uint8_t NewChan;

