EcSUHA/ESP32_DeVICE_Module/ESP32_Control_Module.c
	// valid input happened ?
	if (SCDEH_GetDecUInt8Val(setArgs+parsedKVInput->ESP32_Control_keyData_t[ESP32_Control_Set_IK_WSAP_RF_Channel].off
		,parsedKVInput->ESP32_Control_keyData_t[ESP32_Control_Set_IK_WSAP_RF_Channel].len, &NewChan)) {

		if ( (NewChan >= 1) && (NewChan <= 13) ) {

			// save new channel
			ap_wifi_config.ap.channel = NewChan;

			// mark affected readings for TX
			affectedReadings |= parsedKVInput->ESP32_Control_keyData_t[ESP32_Control_Set_IK_WSAP_RF_Channel].affectedReadings;

//			// New Timestamp
//			SysCfgRamNoMirror->MySCDE_FeatCfgRamNoMirror[ADID].IB01_X_TiSt =
//				GetUniqueTIST();

			// Push processed CMD to to Response ...
//			RespArgsWPos += sprintf( RespArgsWPos,"cmd=WSAP_RF_Channel");

		}
	}

  }

// -------------------------------------------------------------------------------------------------

  // rmax=[ ] -> Setze vom RGB Kanal den roten Anteil maximal (0-x)
  // rmax=[ ] -> Set red component of the RGB channel to maximum (0-x)

  if (parsedKVInput->keysFoundBF == (uint64_t) 1 << ESP32_Control_Set_IK_WSAP_Maximal_Connections)

	{

	uint8_t NewMaxConn;

	// valid input happened ?
	if (SCDEH_GetDecUInt8Val(setArgs+parsedKVInput->ESP32_Control_keyData_t[ESP32_Control_Set_IK_WSAP_Maximal_Connections].off
		,parsedKVInput->ESP32_Control_keyData_t[ESP32_Control_Set_IK_WSAP_Maximal_Connections].len, &NewMaxConn)) {

		if ( (NewMaxConn >= 0) && (NewMaxConn <= 4) ) {

			// save new max conn
			ap_wifi_config.ap.max_connection = MaxConn;

			// mark affected readings for TX
			affectedReadings |= parsedKVInput->ESP32_Control_keyData_t[ESP32_Control_Set_IK_WSAP_Maximal_Connections].affectedReadings;

			// New Timestamp
//			SysCfgRamNoMirror->MyLiGHT_FeatCfgRamNoMirror_M1[ADID].RB01_X_TiSt =
//				GetUniqueTIST();

			// Push processed CMD to to Response ...
//			RespArgsWPos += os_sprintf( RespArgsWPos,"cmd=WSAP_RF_Channel");
 
		}
	}
  }

// --------------------------------------------------------------------------------------------------

  // rmin=[ ] -> Setze vom RGB Kanal den roten Anteil minimal (0-x)
  // rmin=[ ] -> Set red component of the RGB channel to minimum (0-x)

  if (parsedKVInput->keysFoundBF == (uint64_t) 1 << ESP32_Control_Set_IK_WSAP_Authentication_Method) {

	uint8_t NewAuthMode;

	// valid input happened ?
	if (SCDEH_GetQueryKeyID(setArgs+parsedKVInput->ESP32_Control_keyData_t[ESP32_Control_Set_IK_WSAP_Authentication_Method].off
		,parsedKVInput->ESP32_Control_keyData_t[ESP32_Control_Set_IK_WSAP_Authentication_Method].len, &NewAuthMode, Auth_M)) {

		// save auth mode
		ap_wifi_config.ap.authmode = NewAuthMode;

		// mark affected readings for TX
		affectedReadings |= parsedKVInput->ESP32_Control_keyData_t[ESP32_Control_Set_IK_WSAP_Authentication_Method].affectedReadings;

		// New Timestamp
//		SysCfgRamNoMirror->MySCDE_FeatCfgRamNoMirror[ADID].IB01_X_TiSt =
//			GetUniqueTIST();

		// Push processed CMD to to Response ...
//		RespArgsWPos += sprintf( RespArgsWPos,"cmd=WSAP_Authentication_Method");

	}
  }

// --------------------------------------------------------------------------------------------------

  // gval=[0-9] -> Setze Wert für den gruenen Anteil vom RGB Kanal (uint8) (0-x)
  // gval=[0-9] -> Set value for the gree component of the RGB channel (uint8) (0-x)

  if (parsedKVInput->keysFoundBF == (uint64_t) 1 << ESP32_Control_Set_IK_WSAP_SSID) {

	uint8_t NewSSIDSetting;

	// valid input happened ?
	if (SCDEH_GetQueryKeyID(setArgs+parsedKVInput->ESP32_Control_keyData_t[ESP32_Control_Set_IK_WSAP_SSID].off
		,parsedKVInput->ESP32_Control_keyData_t[ESP32_Control_Set_IK_WSAP_SSID].len, &NewSSIDSetting, SSID_H)) {

		// save auth mode
		ap_wifi_config.ap.ssid_hidden = NewSSIDSetting;

		// mark affected readings for TX
		affectedReadings |= parsedKVInput->ESP32_Control_keyData_t[ESP32_Control_Set_IK_WSAP_SSID].affectedReadings;

		// New Timestamp
//		SysCfgRamNoMirror->MySCDE_FeatCfgRamNoMirror[ADID].IB01_X_TiSt =
//			GetUniqueTIST();

		// Push processed CMD to to Response ...
//		RespArgsWPos += sprintf( RespArgsWPos,"cmd=WSAP_SSID");

	}
  }

// --------------------------------------------------------------------------------------------------

  // WSAP-Beacon-Interval=[100-60000] -> Setze den Beacon-Sendeinterval des Wireless Service Access Points
  // WSAP-Beacon-Interval=[100-60000] -> Set the beacon interval of the Wireless Service Access Point

  if (parsedKVInput->keysFoundBF == (uint64_t) 1 << ESP32_Control_Set_IK_WSAP_Beacon_Interval) {

	uint16_t NewBI;

	// valid input happened ?
	if (SCDEH_GetDecUInt16Val(setArgs+parsedKVInput->ESP32_Control_keyData_t[ESP32_Control_Set_IK_WSAP_Beacon_Interval].off
		,parsedKVInput->ESP32_Control_keyData_t[ESP32_Control_Set_IK_WSAP_Beacon_Interval].len, &NewBI)) {

		if ( (NewBI >= 100) && (NewBI <= 60000) ) {

			// save beacon interval
			ap_wifi_config.ap.beacon_interval = (uint16_t) NewBI;

			// mark affected readings for TX
			affectedReadings |= parsedKVInput->ESP32_Control_keyData_t[ESP32_Control_Set_IK_WSAP_Beacon_Interval].affectedReadings;

			// New Timestamp
//			SysCfgRamNoMirror->MySCDE_FeatCfgRamNoMirror[ADID].IB01_X_TiSt =
//				GetUniqueTIST();

			// Push processed CMD to to Response ...
//			RespArgsWPos += sprintf( RespArgsWPos,"cmd=WSAP-Beacon-Interval");

		}
	}

  }

// --------------------------------------------------------------------------------------------------

  // gmax=[ ] -> Setze vom RGB Kanal den gruenen Anteil maximal (0-x)
  // gmax=[ ] -> Set green component of the RGB channel to maximum (0-x)

  else if (parsedKVInput->keysFoundBF == (uint64_t) 1 << ESP32_Control_Set_IK_WSAP_IP_Adress) {

  }

// --------------------------------------------------------------------------------------------------

  // gmin=[ ] -> Setze vom RGB Kanal den gruenen Anteil minimal (0-x)
  // gmin=[ ] -> Set green component of the RGB channel to minimum (0-x)

  else if (parsedKVInput->keysFoundBF == (uint64_t) 1 << ESP32_Control_Set_IK_WSAP_Netmask) {

