EcSUHA/ESP32_DeVICE_Module/ESP32_Control_Module.c
  }

// --------------------------------------------------------------------------------------------------

  // bval=[0-9] -> Setze Wert für den blauen Anteil vom RGB Kanal (uint8) (0-x)
  // bval=[0-9] -> Set value for the blue component of the RGB channel (uint8) (0-x)

  else if (parsedKVInput->keysFoundBF == (uint64_t) 1 << ESP32_Control_Set_IK_WSAP_Gateway_Adress) {

  }

// --------------------------------------------------------------------------------------------------


  // red=[ ] -> Setze RGB Kanal auf Leuchtfarbe rot (0-x)
  // red=[ ] -> Set RGB Channel SCDEing red (0-x)

  else if (parsedKVInput->keysFoundBF == (uint64_t) 1 << ESP32_Control_Set_IK_WSAP_MAC_Adress) {

  }

// --------------------------------------------------------------------------------------------------

  // yell=[ ] -> Setze RGB Kanal auf Leuchtfarbe gelb (0-x)
  // yell=[ ] -> Set RGB Channel SCDEing yellow (0-x)

  else if (parsedKVInput->keysFoundBF == (uint64_t) 1 << ESP32_Control_Set_IK_WiFi_Country) {

	}

// --------------------------------------------------------------------------------------------------

  // yell=[ ] -> Setze RGB Kanal auf Leuchtfarbe gelb (0-x)
  // yell=[ ] -> Set RGB Channel SCDEing yellow (0-x)

  else if (parsedKVInput->keysFoundBF == (uint64_t) 1 << ESP32_Control_Set_IK_WSAP_WiFi_Bandwidth) {

	}

// --------------------------------------------------------------------------------------------------

  // blue=[ ] -> Setze RGB Kanal auf Leuchtfarbe blau (0-x)
  // blue=[ ] -> Set RGB Channel SCDEing blue (0-x)

  else if (parsedKVInput->keysFoundBF == (uint64_t) 1 << ESP32_Control_Set_IK_Station_IP_Adress) {

	}

// --------------------------------------------------------------------------------------------------

  // oran=[ ] -> Setze RGB Kanal auf Leuchtfarbe orange (0-x)
  // oran=[ ] -> Set RGB Channel SCDEing orange (0-x)

  else if (parsedKVInput->keysFoundBF == (uint64_t) 1 << ESP32_Control_Set_IK_Station_Netmask) {

	}

// --------------------------------------------------------------------------------------------------

  // yell=[ ] -> Setze RGB Kanal auf Leuchtfarbe gelb (0-x)
  // yell=[ ] -> Set RGB Channel SCDEing yellow (0-x)

  else if (parsedKVInput->keysFoundBF == (uint64_t) 1 << ESP32_Control_Set_IK_Station_Gateway_Adress) {

	}

// --------------------------------------------------------------------------------------------------

  // yell=[ ] -> Setze RGB Kanal auf Leuchtfarbe gelb (0-x)
  // yell=[ ] -> Set RGB Channel SCDEing yellow (0-x)

  else if (parsedKVInput->keysFoundBF == (uint64_t) 1 << ESP32_Control_Set_IK_Station_MAC_Adress) {

	}

// --------------------------------------------------------------------------------------------------

  // wval=[0-9] -> Setze Wert für warm-weissen Kanal (uint8) (0-x)
  // wval=[0-9] -> Set value for warm white channel (uint8) (0-x)

  else if (parsedKVInput->keysFoundBF == (uint64_t) 1 << ESP32_Control_Set_IK_Station_Auto_Connect) {

	}

// --------------------------------------------------------------------------------------------------

  // yell=[ ] -> Setze RGB Kanal auf Leuchtfarbe gelb (0-x)
  // yell=[ ] -> Set RGB Channel SCDEing yellow (0-x)

  else if (parsedKVInput->keysFoundBF == (uint64_t) 1 << ESP32_Control_Set_IK_Station_WiFi_Bandwidth) {

	}

// --------------------------------------------------------------------------------------------------




















  // bmax=[ ] -> Setze vom RGB Kanal den blauen Anteil maximal (0-x)
  // bmax=[ ] -> Set blue component of the RGB channel to maximum (0-x)

  else if (parsedKVInput->keysFoundBF == (uint64_t) 1 << ESP32_Control_Set_IK_WSAP_DHCPS_Lease_Start_IP) {

	}

//--------------------------------------------------------------------------------------------------

  // bmin=[ ] -> Setze vom RGB Kanal den blauen Anteil minimal (0-x)
  // bmin=[ ] -> Set blue component of the RGB channel to minimum (0-x)

  else if (parsedKVInput->keysFoundBF == (uint64_t) 1 << ESP32_Control_Set_IK_WSAP_DHCPS_Lease_End_IP) {

	}

//--------------------------------------------------------------------------------------------------

  // bdim=[0-9] -> Setze dimmer für den blauen Anteil vom RGB Kanal (uint8) (0-x)
  // bdim=[0-9] -> Set dimming for the blue component of the RGB channel (uint8) (0-x)
/*
  else if (parsedKVInput->keysFoundBF == (uint64_t) 1 << ESP32_Control_Set_IK_WSAP_DHCPS) {

	uint8_t NewDHCPSStatus;

	// valid input happened ?
	if (SCDEH_GetQueryKeyID(setArgs+parsedKVInput->ESP32_Control_keyData_t[ESP32_Control_Set_IK_WSAP_DHCPS].off
		,parsedKVInput->ESP32_Control_keyData_t[ESP32_Control_Set_IK_WSAP_DHCPS].len, &NewDHCPSStatus, DisEn)) {

		// save DHCPS Status
		WifiSoftAPDHCPSStatus = NewDHCPSStatus;

		// mark affected readings for TX
		affectedReadings |= parsedKVInput->ESP32_Control_keyData_t[ESP32_Control_Set_IK_WSAP_DHCPS].affectedReadings;

		// New Timestamp
//		SysCfgRamNoMirror->MySCDE_FeatCfgRamNoMirror[ADID].IB03_X_TiSt =
//			GetUniqueTIST();

		// Push processed CMD to to Response ...
//		RespArgsWPos += os_sprintf( RespArgsWPos,"cmd=WSAP_DHCPS");

		}
	}
*/
//--------------------------------------------------------------------------------------------------

  // gree=[ ] -> Setze RGB Kanal auf Leuchtfarbe grün (0-x)
  // gree=[ ] -> Set RGB Channel SCDEing green (0-x)
/*
  else if (parsedKVInput->keysFoundBF == (uint64_t) 1 << ESP32_Control_Set_IK_WSAP) {

	uint8_t NewApOpMode;

	// valid input happened ?
	if (SCDEH_GetQueryKeyID(setArgs+parsedKVInput->ESP32_Control_keyData_t[ESP32_Control_Set_IK_WSAP].off
		,parsedKVInput->ESP32_Control_keyData_t[ESP32_Control_Set_IK_WSAP].len, &NewApOpMode, DisEn)) {

		// save ap op mode
		WifiApOpMode = NewApOpMode;

		// mark affected readings for TX
		affectedReadings |= parsedKVInput->ESP32_Control_keyData_t[ESP32_Control_Set_IK_WSAP].affectedReadings;

		// New Timestamp
//		SysCfgRamNoMirror->MySCDE_FeatCfgRamNoMirror[ADID].IB05_X_TiSt =
//			GetUniqueTIST();

		// Push processed CMD to to Response ...
//		RespArgsWPos += os_sprintf( RespArgsWPos,"cmd=WSAP");

//		RespArgsWPos = SCDEH_AddCmdToWritePos(RespArgsWPos
//			,SCDE_QueryKeys
//			,ESP32_Control_Set_IK_WSAP);

