EcSUHA/ESP32_DeVICE_Module/ESP32_Control_Module.c
		}
	}
*/
//--------------------------------------------------------------------------------------------------

  // blck=[ ] -> Setze RGB Kanal auf Leuchtfarbe schwarz (0-x)
  // blck=[ ] -> Set RGB Channel SCDEing black (0-x)

  else if (parsedKVInput->keysFoundBF == (uint64_t) 1 << ESP32_Control_Set_IK_Station) {

	}

//--------------------------------------------------------------------------------------------------

  // whte=[ ] -> Setze RGB Kanal auf Leuchtfarbe weiss (0-x)
  // whte=[ ] -> Set RGB Channel SCDEing white (0-x)

  else if (parsedKVInput->keysFoundBF == (uint64_t) 1 << ESP32_Control_Set_IK_Station_DHCP) {

	}

//--------------------------------------------------------------------------------------------------

  // wdim=[0-9] -> Setze dimmer für warm-weissen Kanal (uint8) (0-x)
  // wdim=[0-9] -> Set dimming for warm white channel (uint8) (0-x)
/*
  else if (parsedKVInput->keysFoundBF == (uint64_t) 1 << ESP32_Control_Set_IK_Station_Physical_Mode) {

	uint8_t NewPhyMode;

	// valid input happened ?
	if (SCDEH_GetQueryKeyID(setArgs+parsedKVInput->ESP32_Control_keyData_t[ESP32_Control_Set_IK_Station_Physical_Mode].off
		,parsedKVInput->ESP32_Control_keyData_t[ESP32_Control_Set_IK_Station_Physical_Mode].len, &NewPhyMode, PhMode)) {

		// save Phy Mode
		WifiStationPhyMode = NewPhyMode;

		// mark affected readings for TX
		affectedReadings |= parsedKVInput->ESP32_Control_keyData_t[ESP32_Control_Set_IK_Station_Physical_Mode].affectedReadings;

		// New Timestamp
//		SysCfgRamNoMirror->MySCDE_FeatCfgRamNoMirror[ADID].IB10_X_TiSt =
//			GetUniqueTIST();

		// Push processed CMD to to Response ...
//		RespArgsWPos += os_sprintf( RespArgsWPos,"cmd=Station_Physical_Mode");

		}
	}
*/
//--------------------------------------------------------------------------------------------------

  // wmax=[ ] -> Setze warm-weissen Kanal maximal (0-x)
  // wmax=[ ] -> Set warm white channel maximum (0-x)

  else if (parsedKVInput->keysFoundBF == (uint64_t) 1 << ESP32_Control_Set_IK_Station_Get_RSSI) {

	}

//--------------------------------------------------------------------------------------------------

  // TiSt_NTP_Server_Main=[azAZ09._] -> Setze NTP-Server Adresse (0-x)
  // TiSt_NTP_Server_Main=[azAZ09._] -> Set NTP-Server adress (0-x)
/*
  else if (parsedKVInput->keysFoundBF == (uint64_t) 1 << ESP32_Control_Set_IK_TiSt_NTP_Server_Main) {

	// valid input happened ?
	if (SCDEH_GetSpecialStrVal(setArgs+parsedKVInput->ESP32_Control_keyData_t[ESP32_Control_Set_IK_TiSt_NTP_Server_Main].off
		,parsedKVInput->ESP32_Control_keyData_t[ESP32_Control_Set_IK_TiSt_NTP_Server_Main].len
		,(char*) &SysCfgRamFlashMirrored->NTDomain1
		,sizeof (SysCfgRamFlashMirrored->NTDomain1)
		,2) ) {	

		// save mirror
		SCDE_SaveSysCfgRamFlashMirroredToMirror();

		// stop sntp for changes
		sntp_stop();

		// set new  sntp server name
		sntp_setservername(0, (char*) &SysCfgRamFlashMirrored->NTDomain1);

		// reinit sntp
		sntp_init();

		// mark affected readings for TX
		affectedReadings |= parsedKVInput->ESP32_Control_keyData_t[ESP32_Control_Set_IK_TiSt_NTP_Server_Main].affectedReadings;

		// New Timestamp
		SysCfgRamNoMirror->MySCDE_FeatCfgRamNoMirror[ADID].IB12_X_TiSt =
			GetUniqueTIST();

		// Push processed CMD to to Response ...
		RespArgsWPos += os_sprintf( RespArgsWPos,"cmd=TiSt_NTP_Server_Main");

		}
	}
*/
//--------------------------------------------------------------------------------------------------

  // TiSt_NTP_Server_Backup_1=[azAZ09._] -> Setze NTP-Server Adresse, Backup 1 (0-x)
  // TiSt_NTP_Server_Backup_1=[azAZ09._] -> Set NTP-Server adress, Backup 1 (0-x)
/*
  else if (parsedKVInput->keysFoundBF == (uint64_t) 1 << ESP32_Control_Set_IK_TiSt_NTP_Server_Backup_1) {

	// valid input happened ?
	if (SCDEH_GetSpecialStrVal(setArgs+parsedKVInput->ESP32_Control_keyData_t[ESP32_Control_Set_IK_TiSt_NTP_Server_Backup_1].off
		,parsedKVInput->ESP32_Control_keyData_t[ESP32_Control_Set_IK_TiSt_NTP_Server_Backup_1].len
		,(char*) &SysCfgRamFlashMirrored->NTDomain2
		,sizeof (SysCfgRamFlashMirrored->NTDomain2)
		,2) ) {	

		// save mirror
		SCDE_SaveSysCfgRamFlashMirroredToMirror();

		// stop sntp for changes
		sntp_stop();

		// set new  sntp server name
		sntp_setservername(1, (char*) &SysCfgRamFlashMirrored->NTDomain2);

		// reinit sntp
		sntp_init();

		// mark affected readings for TX
		affectedReadings |= parsedKVInput->ESP32_Control_keyData_t[ESP32_Control_Set_IK_TiSt_NTP_Server_Backup_1].affectedReadings;

		// New Timestamp
		SysCfgRamNoMirror->MySCDE_FeatCfgRamNoMirror[ADID].IB12_X_TiSt =
			GetUniqueTIST();

		// Push processed CMD to to Response ...
		RespArgsWPos += os_sprintf( RespArgsWPos,"cmd=TiSt_NTP_Server_Backup_1");

		}
	}
*/
//--------------------------------------------------------------------------------------------------

  // TiSt_NTP_Server_Backup_2=[azAZ09._] char[?] -> Setze NTP-Server Adresse, Backup 2 (0-x)
  // TiSt_NTP_Server_Backup_2=[azAZ09._] char[?] -> Set NTP-Server adress, Backup 2 (0-x)
/*
  else if (parsedKVInput->keysFoundBF == (uint64_t) 1 << ESP32_Control_Set_IK_TiSt_NTP_Server_Backup_2) {

	// valid input happened ?
	if (SCDEH_GetSpecialStrVal(setArgs+parsedKVInput->ESP32_Control_keyData_t[ESP32_Control_Set_IK_TiSt_NTP_Server_Backup_2].off
		,parsedKVInput->ESP32_Control_keyData_t[ESP32_Control_Set_IK_TiSt_NTP_Server_Backup_2].len
		,(char*) &SysCfgRamFlashMirrored->NTDomain3
		,sizeof (SysCfgRamFlashMirrored->NTDomain3)
		,2) ) {	

		// save mirror
		SCDE_SaveSysCfgRamFlashMirroredToMirror();

		// stop sntp for changes
		sntp_stop();

		// set new  sntp server name
		sntp_setservername(2, (char*) &SysCfgRamFlashMirrored->NTDomain3);

		// reinit sntp
		sntp_init();

		// mark affected readings for TX
		affectedReadings |= parsedKVInput->ESP32_Control_keyData_t[ESP32_Control_Set_IK_TiSt_NTP_Server_Backup_2].affectedReadings;

		// New Timestamp
		SysCfgRamNoMirror->MySCDE_FeatCfgRamNoMirror[ADID].IB12_X_TiSt =
			GetUniqueTIST();

		// Push processed CMD to to Response ...
		RespArgsWPos += os_sprintf( RespArgsWPos,"cmd=TiSt_NTP_Server_Backup_2");

