EcSUHA/ESP32_DeVICE_Module/ESP32_Control_Module.c
		}
	}
*/
//--------------------------------------------------------------------------------------------------

  // wmax=[ ] -> Setze warm-weissen Kanal maximal (0-x) 
  // wmax=[ ] -> Set warm white channel maximum (0-x)
/*
  else if (parsedKVInput->keysFoundBF == (uint64_t) 1 << ESP32_Control_Set_IK_TiSt_Time_Zone) {

	int8 NewTZ;

	// valid input happened ?
	if (SCDEH_GetDecInt8Val((uint8*)Args+parsedKVInput->ESP32_Control_keyData_t[ESP32_Control_Set_IK_TiSt_Time_Zone].off
		,parsedKVInput->ESP32_Control_keyData_t[ESP32_Control_Set_IK_TiSt_Time_Zone].len, &NewTZ)) {

		if ( (NewTZ >= -11) && (NewTZ <= 13) ) {

			// save new time-zone
			SysCfgRamFlashMirrored->NTTimezone = NewTZ;

			// save mirror
			SCDE_SaveSysCfgRamFlashMirroredToMirror();

			// stop sntp for changes
			sntp_stop();

			// set new sntp TZ
			sntp_set_timezone(NewTZ);

			// reinit sntp
			sntp_init();

			// mark affected readings for TX
			affectedReadings |= parsedKVInput->ESP32_Control_keyData_t[ESP32_Control_Set_IK_TiSt_Time_Zone].affectedReadings;

			// New Timestamp
			SysCfgRamNoMirror->MySCDE_FeatCfgRamNoMirror[ADID].IB12_X_TiSt =
				GetUniqueTIST();

			// Push processed CMD to to Response ...
			RespArgsWPos += os_sprintf( RespArgsWPos,"cmd=TiSt_Time_Zone");

			}
		}

	}
*/
/*
//--------------------------------------------------------------------------------------------------

  // wmax=[ ] -> Setze warm-weissen Kanal maximal (0-x)
  // wmax=[ ] -> Set warm white channel maximum (0-x)

  else if (parsedKVInput->keysFoundBF == (uint64_t) 1 << ESP32_Control_Set_IK_TiSt_Get_Time) {

	}


//--------------------------------------------------------------------------------------------------

  // wmax=[ ] -> Setzt das Geräte warm-weissen Kanal maximal (0-x)
  // wmax=[ ] -> Set the Device into state 'restart'

  else if (parsedKVInput->keysFoundBF == (uint64_t) 1 << ESP32_Control_Set_IK_SoCHW_Restart) {

	system_restart();

	}
*/
//--------------------------------------------------------------------------------------------------

  // SoCHW_Factory_Reset_SCDE=[ ] -> Setzt die Smart-Connected-Device-Engine auf Werkseinstellung zurück 'factory reset'
  // SoCHW_Factory_Reset_SCDE=[ ] -> Set Smart-Connected-Device-Engine to state 'factory reset'
/*
  else if (parsedKVInput->keysFoundBF == (uint64_t) 1 << ESP32_Control_Set_IK_SoCHW_Factory_Reset_SCDE) {

//	SCDE_ReconstructSysCfgRomNoMirror();		// todo
//	SCDE_ReconstructSysCfgRamNoMirror();		// reconstruct Sys-Cfg stored in ram (done by reboot)
	SCDE_ReconstructSysCfgRamFlashMirrored();	// reconstruct Sys-Cfg stored in ram (flash-mirrored) 
	SCDE_ReconstructSysCfgRamRtcMirrored();		// reconstruct Sys-Cfg stored in rtc

	// initial setup / correction of the SDK parameters
	SCDE_SDKInitialParameterSetup();

	// fresh start
	system_restart();

	}
*/
//--------------------------------------------------------------------------------------------------

  // SoCHW_Factory_Reset_CAPI=[ ] -> Setzt die SoC-Hardware-Chip-API auf Werkseinstellung zurück 'factory reset'
  // SoCHW_Factory_Reset_CAPI=[ ] -> Set SoC-Hardware-Chip-API to state 'factory reset'

  else if (parsedKVInput->keysFoundBF == (uint64_t) 1 << ESP32_Control_Set_IK_SoCHW_Factory_Reset_CAPI) {

	// restore SDK parameters (SDK-factory reset)
	system_restore();

//	SCDE_ReconstructSysCfgRomNoMirror();		// todo
//	SCDE_ReconstructSysCfgRamNoMirror();		// reconstruct Sys-Cfg stored in ram (done by reboot)
//	SCDE_ReconstructSysCfgRamFlashMirrored();	// reconstruct Sys-Cfg stored in ram (flash-mirrored) 
//	SCDE_ReconstructSysCfgRamRtcMirrored();		// reconstruct Sys-Cfg stored in rtc

	// initial setup / correction of the SDK parameters
//	SCDE_SDKInitialParameterSetup();

	// fresh start
	system_restart();

	}

//--------------------------------------------------------------------------------------------------

  // SoCHW_Factory_Reset_CAPI=[ ] -> Setzt die SoC-Hardware-Chip-API auf Werkseinstellung zurück 'factory reset'
  // SoCHW_Factory_Reset_CAPI=[ ] -> Set SoC-Hardware-Chip-API to state 'factory reset'

  else if (parsedKVInput->keysFoundBF == (uint64_t) 1 << ESP32_Control_Set_IK_SoCHW_Factory_Reset) {

	// restore SDK parameters (SDK-factory reset)
	system_restore();

	// initial setup / correction of the SDK parameters
//	SCDE_SDKInitialParameterSetup();

	// fresh start
	system_restart();

	}

//>Caps Bit n.a.------------------------------------------------------------------------------------

  // name=[a-zA-Z0-9_.] -> Setze einen neuen Feature Namen (char[31]) (0-x)
  // name=[a-zA-Z0-9_.] -> Set a new Feature Name (char[31]) (0-x)
/*
  else if (parsedKVInput->keysFoundBF == (uint64_t) 1 << ESP32_Control_Set_IK_name) {

	}
*/
//>Caps Bit n.a.------------------------------------------------------------------------------------

  // caps=[ ] -> Fragt nach den Fähigkeiten-Bits (0-x)
  // caps=[ ] -> Request for Capabilities-Bits (0-x)
/*
  else if (parsedKVInput->keysFoundBF == (uint64_t) 1 << ESP32_Control_Set_IK_caps) {

	// mark affected readings for TX
	affectedReadings |= parsedKVInput->ESP32_Control_keyData_t[ESP32_Control_Set_IK_caps].affectedReadings;

	// New Timestamp
//	WriteInt32toSysCfgRamRtcMirrored(&SysCfgRamRtcMirrored->MySCDE_FeatCfgRamRtcMirrored_M1[ADID].IB01_X_TiSt,
//		GetUniqueTIST());
//bug in anderem code

	// Push processed CMD to to Response ...
//	RespArgsWPos += os_sprintf( RespArgsWPos,"cmd=caps");

	}
*/
//--------------------------------------------------------------------------------------------------



// -------------------------------------------------------------------------------------------------
// Save changes to SDK
// -------------------------------------------------------------------------------------------------

  // Processed block #01 readings, that affects ap_wifi_config (WSAP-Wifi-Configuration) ? then save & set
  if (affectedReadings & ( SCDE_R_NAME
			| SCDE_R_WSAP_Password
			| SCDE_R_WSAP_RF_Channel
			| SCDE_R_WSAP_Maximal_Connections
			| SCDE_R_WSAP_Authentication_Method
			| SCDE_R_WSAP_SSID
			| SCDE_R_WSAP_Beacon_Interval) ) {

	# if SCDE_WIFI_DBG >= 5
	HexDumpOut ("WSAP ap_wifi_config ch!",
		&ap_wifi_config,
		sizeof(ap_wifi_config));
	# endif

