EcSUHA/ESP32_DeVICE_Module/ESP32_Control_Module.c
	}
*/






  // debugview all readings
  affectedReadings = 0xffffffff;

// =================================================================================================

  // prepare the readings update according to 'affectedReadings'

  // do we have updates?
  if (affectedReadings) {

  SCDEFn->readingsBeginUpdateFn(Common_Definition);

  }

  // temp for reading creation
  uint8_t *readingNameText;
  size_t readingNameTextLen;
  uint8_t *readingValueText;
  size_t readingValueTextLen;

// ------------------------------------------------------------------------------------------------- 

  // add Reading 'Name'
  if (affectedReadings & SCDE_R_NAME) {

	#if SCDEH_DBG >= 5
	printf("&NAME=%s"
		,(char*) &ap_wifi_config.ap.ssid);
	#endif


	readingNameTextLen = asprintf((char **) &readingNameText
		,"Name");

	readingValueTextLen = asprintf((char **) &readingValueText
		,"%.*s"
		,strlen((char *) &ap_wifi_config.ap.ssid)
		,(char *) &ap_wifi_config.ap.ssid);		// max length check??

	SCDEFn->readingsBulkUpdateFn(Common_Definition
		,readingNameText
		,readingNameTextLen
		,readingValueText
		,readingValueTextLen);

  }

// -------------------------------------------------------------------------------------------------

  // add Reading 'WSAP_Password'
  if (affectedReadings & SCDE_R_WSAP_Password) {

	#if SCDEH_DBG >= 5
	printf("&WSAP_Password=%s"
		,(char*) &ap_wifi_config.ap.password);
	#endif


	readingNameTextLen = asprintf((char **) &readingNameText
		,"WSAP_Password");

	readingValueTextLen = asprintf((char **) &readingValueText
		,"%.*s"
		,strlen((char *) &ap_wifi_config.ap.password)
		,(char *) &ap_wifi_config.ap.password);		// max length check??

	SCDEFn->readingsBulkUpdateFn(Common_Definition
		,readingNameText
		,readingNameTextLen
		,readingValueText
		,readingValueTextLen);

  }

// ------------------------------------------------------------------------------------------------- 

  // add Reading 'WSAP_RF_Channel'
  if (affectedReadings & SCDE_R_WSAP_RF_Channel) {

	#if SCDEH_DBG >= 5
	printf("&WSAP_RF_Channel=%u"
		,ap_wifi_config.ap.channel);
	#endif


	readingNameTextLen = asprintf((char **) &readingNameText
		,"WSAP_RF_Channel");

	readingValueTextLen = asprintf((char **) &readingValueText
		,"%u"
		,ap_wifi_config.ap.channel);

	SCDEFn->readingsBulkUpdateFn(Common_Definition
		,readingNameText
		,readingNameTextLen
		,readingValueText
		,readingValueTextLen);

  }

// ------------------------------------------------------------------------------------------------- 

  // add Reading 'WSAP_Maximal_Connections'
  if (affectedReadings & SCDE_R_WSAP_Maximal_Connections) {

	#if SCDEH_DBG >= 5
	printf("&WSAP_Maximal_Connections=%u"
		,ap_wifi_config.ap.max_connection);
	#endif


	readingNameTextLen = asprintf((char **) &readingNameText
		,"WSAP_Maximal_Connections");

	readingValueTextLen = asprintf((char **) &readingValueText
		,"%u"
		,ap_wifi_config.ap.max_connection);

	SCDEFn->readingsBulkUpdateFn(Common_Definition
		,readingNameText
		,readingNameTextLen
		,readingValueText
		,readingValueTextLen);

  }

// ------------------------------------------------------------------------------------------------- 

  // add Reading 'WSAP_Authentication_Method'
  if (affectedReadings & SCDE_R_WSAP_Authentication_Method) {

	#if SCDEH_DBG >= 5
	printf("&WSAP_Authentication_Method=%s"
		,SCDE_GetDesc(Auth_M,ap_wifi_config.ap.authmode));
	#endif


	readingNameTextLen = asprintf((char **) &readingNameText
		,"WSAP_Authentication_Method");

	readingValueTextLen = asprintf((char **) &readingValueText
		,"%s"
		,SCDE_GetDesc(Auth_M,ap_wifi_config.ap.authmode));

	SCDEFn->readingsBulkUpdateFn(Common_Definition
		,readingNameText
		,readingNameTextLen
		,readingValueText
		,readingValueTextLen);

  }

// ------------------------------------------------------------------------------------------------- 

  // add Reading 'WSAP_SSID'
  if (affectedReadings & SCDE_R_WSAP_SSID) {

	#if SCDEH_DBG >= 5
	printf("&WSAP_SSID=%s"
		,SCDE_GetDesc(SSID_H,ap_wifi_config.ap.ssid_hidden));
	#endif


	readingNameTextLen = asprintf((char **) &readingNameText
		,"WSAP_SSID");

	readingValueTextLen = asprintf((char **) &readingValueText
		,"%s"
		,SCDE_GetDesc(SSID_H,ap_wifi_config.ap.ssid_hidden));

	SCDEFn->readingsBulkUpdateFn(Common_Definition
		,readingNameText
		,readingNameTextLen
		,readingValueText
		,readingValueTextLen);

  }

// ------------------------------------------------------------------------------------------------- 

  // add Reading 'WSAP_Beacon_Interval'
  if (affectedReadings & SCDE_R_WSAP_Beacon_Interval) {

	#if SCDEH_DBG >= 5
	printf("&WSAP_Beacon_Interval=%u"
		,ap_wifi_config.ap.beacon_interval);
	#endif


	readingNameTextLen = asprintf((char **) &readingNameText
		,"WSAP_RF_Channel");

	readingValueTextLen = asprintf((char **) &readingValueText
		,"%u"
		,ap_wifi_config.ap.beacon_interval);

	SCDEFn->readingsBulkUpdateFn(Common_Definition
		,readingNameText
		,readingNameTextLen
		,readingValueText
		,readingValueTextLen);

  }

// -------------------------------------------------------------------------------------------------

  // add Reading 'WSAP_IP_Adress'
  if (affectedReadings & SCDE_R_WSAP_IP_Adress) {

	#if SCDEH_DBG >= 5
	printf("&WSAP_IP_Adress=%03d.%03d.%03d.%03d"
		,ap_ip_info.ip.addr & 0xff
		,(ap_ip_info.ip.addr >> 8) & 0xff
		,(ap_ip_info.ip.addr >> 16) & 0xff
		,ap_ip_info.ip.addr >> 24);
	#endif


	readingNameTextLen = asprintf((char **) &readingNameText
		,"WSAP_IP_Adress");

	readingValueTextLen = asprintf((char **) &readingValueText
		,"%03d.%03d.%03d.%03d"
		,ap_ip_info.ip.addr & 0xff
		,(ap_ip_info.ip.addr >> 8) & 0xff
		,(ap_ip_info.ip.addr >> 16) & 0xff
		,ap_ip_info.ip.addr >> 24);

	SCDEFn->readingsBulkUpdateFn(Common_Definition
		,readingNameText
		,readingNameTextLen
		,readingValueText
		,readingValueTextLen);

