EcSUHA/ESP32_DeVICE_Module/ESP32_Control_Module.c
  }

// -------------------------------------------------------------------------------------------------

  // add Reading 'WSAP_Netmask'
  if (affectedReadings & SCDE_R_WSAP_Netmask) {

	#if SCDEH_DBG >= 5
	printf("&WSAP_Netmask=%03d.%03d.%03d.%03d"
		,ap_ip_info.netmask.addr & 0xff
		,(ap_ip_info.netmask.addr >> 8) & 0xff
		,(ap_ip_info.netmask.addr >> 16) & 0xff
		,ap_ip_info.netmask.addr >> 24);
	#endif


	readingNameTextLen = asprintf((char **) &readingNameText
		,"WSAP_Netmask");

	readingValueTextLen = asprintf((char **) &readingValueText
		,"%03d.%03d.%03d.%03d"
		,ap_ip_info.netmask.addr & 0xff
		,(ap_ip_info.netmask.addr >> 8) & 0xff
		,(ap_ip_info.netmask.addr >> 16) & 0xff
		,ap_ip_info.netmask.addr >> 24);

	SCDEFn->readingsBulkUpdateFn(Common_Definition
		,readingNameText
		,readingNameTextLen
		,readingValueText
		,readingValueTextLen);

  }

// -------------------------------------------------------------------------------------------------

  // add Reading 'WSAP_Gateway_Adress'
  if (affectedReadings & SCDE_R_WSAP_Gateway_Adress) {

	#if SCDEH_DBG >= 5
	printf("&WSAP_Gateway_Adress=%03d.%03d.%03d.%03d"
		,ap_ip_info.gw.addr & 0xff
		,(ap_ip_info.gw.addr >> 8) & 0xff
		,(ap_ip_info.gw.addr >> 16) & 0xff
		,ap_ip_info.gw.addr >> 24);
	#endif


	readingNameTextLen = asprintf((char **) &readingNameText
		,"WSAP_Gateway_Adress");

	readingValueTextLen = asprintf((char **) &readingValueText
		,"%03d.%03d.%03d.%03d"
		,ap_ip_info.gw.addr & 0xff
		,(ap_ip_info.gw.addr >> 8) & 0xff
		,(ap_ip_info.gw.addr >> 16) & 0xff
		,ap_ip_info.gw.addr >> 24);

	SCDEFn->readingsBulkUpdateFn(Common_Definition
		,readingNameText
		,readingNameTextLen
		,readingValueText
		,readingValueTextLen);
  }

// -------------------------------------------------------------------------------------------------

  // add Reading 'WSAP_MAC_Adress'
  if (affectedReadings & SCDE_R_WSAP_MAC_Adress) {

	#if SCDEH_DBG >= 5
	printf("&WSAP_MAC_Adress=%02X.%02X.%02X.%02X.%02X.%02X.%02X.%02X"
		,ap_mac_addr[0]
		,ap_mac_addr[1]
		,ap_mac_addr[2]
		,ap_mac_addr[3]
		,ap_mac_addr[4]
		,ap_mac_addr[5]
		,ap_mac_addr[6]
		,ap_mac_addr[7]);
	#endif


	readingNameTextLen = asprintf((char **) &readingNameText
		,"WSAP_MAC_Adress");

	readingValueTextLen = asprintf((char **) &readingValueText
		,"%02X.%02X.%02X.%02X.%02X.%02X.%02X.%02X"
		,ap_mac_addr[0]
		,ap_mac_addr[1]
		,ap_mac_addr[2]
		,ap_mac_addr[3]
		,ap_mac_addr[4]
		,ap_mac_addr[5]
		,ap_mac_addr[6]
		,ap_mac_addr[7]);

	SCDEFn->readingsBulkUpdateFn(Common_Definition
		,readingNameText
		,readingNameTextLen
		,readingValueText
		,readingValueTextLen);

  }

// -------------------------------------------------------------------------------------------------

  // add Reading 'WSAP_WiFi_Bandwidth'
  if (affectedReadings & SCDE_R_WSAP_WiFi_Bandwidth) {

	#if SCDEH_DBG >= 5
	printf("&WSAP_WiFi_Bandwidth=%s"
		,SCDE_GetDesc(wifiBandwidth, ap_wifi_bandwidth));	
	#endif


	readingNameTextLen = asprintf((char **) &readingNameText
		,"WSAP_WiFi_Bandwidth");

	readingValueTextLen = asprintf((char **) &readingValueText
		,"%s"
		,SCDE_GetDesc(wifiBandwidth, ap_wifi_bandwidth));

	SCDEFn->readingsBulkUpdateFn(Common_Definition
		,readingNameText
		,readingNameTextLen
		,readingValueText
		,readingValueTextLen);

  }

// -------------------------------------------------------------------------------------------------

  // add Reading 'WiFi_Country'
  if (affectedReadings & SCDE_R_WiFi_Country) {

	#if SCDEH_DBG >= 5
	printf("&WiFi_Country=%s"
		,SCDE_GetDesc(wifiCountry, &country));
	#endif


	readingNameTextLen = asprintf((char **) &readingNameText
		,"WiFi_Country");

	readingValueTextLen = asprintf((char **) &readingValueText
		,"%s"
		,SCDE_GetDesc(wifiCountry, &country));

	SCDEFn->readingsBulkUpdateFn(Common_Definition
		,readingNameText
		,readingNameTextLen
		,readingValueText
		,readingValueTextLen);

  }

// -------------------------------------------------------------------------------------------------

  // add Reading 'Station_IP_Adress'
  if (affectedReadings & SCDE_R_Station_IP_Adress) {

	#if SCDEH_DBG >= 5
	printf("&Station_IP_Adress=%03d.%03d.%03d.%03d"
		,sta_ip_info.ip.addr & 0xff
		,(sta_ip_info.ip.addr >> 8) & 0xff
		,(sta_ip_info.ip.addr >> 16) & 0xff
		,sta_ip_info.ip.addr >> 24);
	#endif


	readingNameTextLen = asprintf((char **) &readingNameText
		,"Station_IP_Adress");

	readingValueTextLen = asprintf((char **) &readingValueText
		,"%03d.%03d.%03d.%03d"
		,sta_ip_info.ip.addr & 0xff
		,(sta_ip_info.ip.addr >> 8) & 0xff
		,(sta_ip_info.ip.addr >> 16) & 0xff
		,sta_ip_info.ip.addr >> 24);

	SCDEFn->readingsBulkUpdateFn(Common_Definition
		,readingNameText
		,readingNameTextLen
		,readingValueText
		,readingValueTextLen);

  }

// -------------------------------------------------------------------------------------------------

  // add Reading 'Station_Netmask'
  if (affectedReadings & SCDE_R_Station_Netmask) {

	#if SCDEH_DBG >= 5
	printf("&Station_Netmask=%03d.%03d.%03d.%03d"
		,sta_ip_info.netmask.addr & 0xff
		,(sta_ip_info.netmask.addr >> 8) & 0xff
		,(sta_ip_info.netmask.addr >> 16) & 0xff
		,sta_ip_info.netmask.addr >> 24);
	#endif


	readingNameTextLen = asprintf((char **) &readingNameText
		,"Station_Netmask");

	readingValueTextLen = asprintf((char **) &readingValueText
		,"%03d.%03d.%03d.%03d"
		,sta_ip_info.netmask.addr & 0xff
		,(sta_ip_info.netmask.addr >> 8) & 0xff
		,(sta_ip_info.netmask.addr >> 16) & 0xff
		,sta_ip_info.netmask.addr >> 24);

	SCDEFn->readingsBulkUpdateFn(Common_Definition
		,readingNameText
		,readingNameTextLen
		,readingValueText
		,readingValueTextLen);

  }

// -------------------------------------------------------------------------------------------------

  // add Reading 'Station_Gateway_Adress'
  if (affectedReadings & SCDE_R_Station_Gateway_Adress) {

