EcSUHA/ESP32_DeVICE_Module/ESP32_Control_Module.c
	#if SCDEH_DBG >= 5
	printf("&Station_Gateway_Adress=%03d.%03d.%03d.%03d"
		,sta_ip_info.gw.addr & 0xff
		,(sta_ip_info.gw.addr >> 8) & 0xff
		,(sta_ip_info.gw.addr >> 16) & 0xff
		,sta_ip_info.gw.addr >> 24);
	#endif


	readingNameTextLen = asprintf((char **) &readingNameText
		,"Station_Gateway_Adress");

	readingValueTextLen = asprintf((char **) &readingValueText
		,"%03d.%03d.%03d.%03d"
		,sta_ip_info.gw.addr & 0xff
		,(sta_ip_info.gw.addr >> 8) & 0xff
		,(sta_ip_info.gw.addr >> 16) & 0xff
		,sta_ip_info.gw.addr >> 24);

	SCDEFn->readingsBulkUpdateFn(Common_Definition
		,readingNameText
		,readingNameTextLen
		,readingValueText
		,readingValueTextLen);

  }

// -------------------------------------------------------------------------------------------------

  // add Reading 'Station_MAC_Adress'
  if (affectedReadings & SCDE_R_Station_MAC_Adress) {

	#if SCDEH_DBG >= 5
	printf("&Station_MAC_Adress=%02X.%02X.%02X.%02X.%02X.%02X.%02X.%02X"
		,sta_mac_addr[0]
		,sta_mac_addr[1]
		,sta_mac_addr[2]
		,sta_mac_addr[3]
		,sta_mac_addr[4]
		,sta_mac_addr[5]
		,sta_mac_addr[6]
		,sta_mac_addr[7]);
	#endif


	readingNameTextLen = asprintf((char **) &readingNameText
		,"Station_MAC_Adress");

	readingValueTextLen = asprintf((char **) &readingValueText
		,"%02X.%02X.%02X.%02X.%02X.%02X.%02X.%02X"
		,sta_mac_addr[0]
		,sta_mac_addr[1]
		,sta_mac_addr[2]
		,sta_mac_addr[3]
		,sta_mac_addr[4]
		,sta_mac_addr[5]
		,sta_mac_addr[6]
		,sta_mac_addr[7]);

	SCDEFn->readingsBulkUpdateFn(Common_Definition
		,readingNameText
		,readingNameTextLen
		,readingValueText
		,readingValueTextLen);

  }

// -------------------------------------------------------------------------------------------------

  // add Reading 'Station_Auto_Connect'
  if (affectedReadings & SCDE_R_Station_Auto_Connect) {

	#if SCDEH_DBG >= 5
	printf("&Station_Auto_Connect=%s"
		,SCDE_GetDesc(DisEn, sta_autoconnect_status));
	#endif


	readingNameTextLen = asprintf((char **) &readingNameText
		,"Station_Auto_Connect");

	readingValueTextLen = asprintf((char **) &readingValueText
		,"%s"
		,SCDE_GetDesc(DisEn, sta_autoconnect_status));

	SCDEFn->readingsBulkUpdateFn(Common_Definition
		,readingNameText
		,readingNameTextLen
		,readingValueText
		,readingValueTextLen);

  }

// -------------------------------------------------------------------------------------------------

  // add Reading 'Station_WiFi_Bandwidth'
  if (affectedReadings & SCDE_R_Station_WiFi_Bandwidth) {

	#if SCDEH_DBG >= 5
	printf("&Station_WiFi_Bandwidth=%s"
		,SCDE_GetDesc(wifiBandwidth, sta_wifi_bandwidth));
	#endif


	readingNameTextLen = asprintf((char **) &readingNameText
		,"Station_WiFi_Bandwidth");

	readingValueTextLen = asprintf((char **) &readingValueText
		,"%s"
		,SCDE_GetDesc(wifiBandwidth, sta_wifi_bandwidth));

	SCDEFn->readingsBulkUpdateFn(Common_Definition
		,readingNameText
		,readingNameTextLen
		,readingValueText
		,readingValueTextLen);

  }






















/*
//> Add Readings: Internals - TiSt-Sharing - Block 3 ------------------------------------------------

  if (affectedReadings & (SCDE_R_WSAP_DHCPS_Lease_Start_IP
		| SCDE_R_WSAP_DHCPS_Lease_End_IP
		| SCDE_R_WSAP_DHCPS ) ) {

	RespArgsWPos += os_sprintf( RespArgsWPos
		,"&WSAP_DHCPS_Lease_Start_IP=%03d.%03d.%03d.%03d"
		 "&WSAP_DHCPS_Lease_End_IP=%03d.%03d.%03d.%03d"
		 "&WSAP_DHCPS=%s"
		, dhcps_lease.start_ip.addr & 0xff
		,(dhcps_lease.start_ip.addr >> 8) & 0xff
		,(dhcps_lease.start_ip.addr >> 16) & 0xff
		, dhcps_lease.start_ip.addr >> 24
		, dhcps_lease.end_ip.addr & 0xff
		,(dhcps_lease.end_ip.addr >> 8) & 0xff
		,(dhcps_lease.end_ip.addr >> 16) & 0xff
		, dhcps_lease.end_ip.addr >> 24
		,SCDE_GetDesc(DisEn, WifiSoftAPDHCPSStatus));
  }
*/

/*
//> Add Readings: Internals - TiSt-Sharing - Block 5 ------------------------------------------------

  if (affectedReadings & SCDE_R_WSAP) {

	RespArgsWPos += os_sprintf( RespArgsWPos
		,"&WSAP=%s"
		,SCDE_GetDesc(DisEn, WifiApOpMode));

  }
*/

/*
//> Add Readings: Internals - TiSt-Sharing - Block 7 ------------------------------------------------

  if (affectedReadings & SCDE_R_Station) {

	RespArgsWPos += os_sprintf( RespArgsWPos
		,"&Station=%s"
		,SCDE_GetDesc(DisEn, WifiStaOpMode) );

  }

//> Add Readings: Internals - TiSt-Sharing - Block 8 ------------------------------------------------

  if (affectedReadings & SCDE_R_Station_DHCP) {

	RespArgsWPos += os_sprintf( RespArgsWPos
		,"&Station_DHCP=%s"
		,SCDE_GetDesc(DisEn, WifiStationDHCPStatus));

  }
*/

/*
//> Add Readings: Internals - TiSt-Sharing - Block 10 ------------------------------------------------

  if (affectedReadings & SCDE_R_Station_Physical_Mode) {

	RespArgsWPos += os_sprintf( RespArgsWPos
		,"&Station_Physical_Mode=%s"
		,SCDE_GetDesc(PhMode, WifiStationPhyMode));

  }
*/

/*
//> Add Readings: Internals - TiSt-Sharing - Block 12 ------------------------------------------------

  if (affectedReadings & (SCDE_R_TiSt_NTP_Server_Main
		| SCDE_R_TiSt_NTP_Server_Backup_1
		| SCDE_R_TiSt_NTP_Server_Backup_2
		| SCDE_R_TiSt_Time_Zone) ) {

	RespArgsWPos += os_sprintf( RespArgsWPos
		,"&TiSt_NTP_Server_Main=%s"
		 "&TiSt_NTP_Server_Backup_1=%s"
		 "&TiSt_NTP_Server_Backup_2=%s"
		 "&TiSt_Time_Zone=%d"
		,sntp_getservername(0)
		,sntp_getservername(1)
		,sntp_getservername(2)
		,sntp_get_timezone());

  }

//> Add Readings: Readings - TiSt-Sharing - Block 1 ------------------------------------------------

  if (affectedReadings & (SCDE_R_Station_RSSI
		| SCDE_R_TiSt_Time) ) {

	RespArgsWPos += os_sprintf( RespArgsWPos
		,"&Station_RSSI=%d"
		 "&TiSt_Time=%s"
		,wifi_station_get_rssi()
		,sntp_get_real_time(sntp_get_current_timestamp()));

  }

//> Add Readings: Readings - TiSt-Sharing - Block 2 ------------------------------------------------

  if (affectedReadings & SCDE_R_Station_RSSI) {

	RespArgsWPos += os_sprintf( RespArgsWPos
		,"&SoC_Info=SDKV:%s ChID:%X BootV:%d BootP:%X FlashID:%X"
		 "&Firmware=V %u.%u, Build %u"
		,system_get_sdk_version()
		,system_get_chip_id()
		,system_get_boot_version()
		,system_upgrade_userbin_check()
		,spi_flash_get_id()
		,(unsigned int) SysCfgRamFlashMirrored->Version_major
		,(unsigned int) SysCfgRamFlashMirrored->Version_minor
		,(unsigned int) SysCfgRamFlashMirrored->build);

