EcSUHA/ESP32_DeVICE_Module/ESP32_Control_Module.c
  // length of attr-Val
  size_t attrValLen = argsLen - i;

  // veryfy lengths > 0, definition 0 allowed
  if ( (defNameLen == 0) || (attrNameLen == 0) )

		{

		// response with error text
		asprintf(&retMsg
				,"Could not interpret command ''! Usage: Attr <defname> <attrname> [<attrval>]");

		return retMsg;

	//	}

// -------------------------------------------------------------------------------------------------
*/

  return retMsg;

}



/**
 * --------------------------------------------------------------------------------------------------
 *  FName: ESP32_Control_Shutdown
 *  Desc: called after 
 *  Info: Invoked by cmd-line 'Undefine ESP32_Control_Definition.common.Name'
 *  Para: ESP32_Control_Definition_t *ESP32_Control_Definition -> WebIF Definition that should be removed
 *  Rets: strTextMultiple_t* -> response text NULL=no text
 * --------------------------------------------------------------------------------------------------
 */
strTextMultiple_t* ICACHE_FLASH_ATTR
ESP32_Control_Shutdown(Common_Definition_t* Common_Definition)
  {

  // for Fn response msg
  strTextMultiple_t *retMsg = NULL;

  // make common ptr to modul specific ptr
  ESP32_Control_Definition_t* ESP32_Control_Definition =
	(ESP32_Control_Definition_t*) Common_Definition;

// -------------------------------------------------------------------------------------------------

  #if SCDEH_DBG >= 5
  printf("\n|ESP32_Control_Shutdown, Name:%.*s>"
	,ESP32_Control_Definition->common.nameLen
	,ESP32_Control_Definition->common.name);
  #endif

// -------------------------------------------------------------------------------------------------

  return retMsg;

  }











